app/views/statuses/index.html.erb


<%= line_chart Status.group(:created_at).sum(:food) %>
---
SELECT SUM("statuses"."food") AS "sum_food", "statuses"."created_at" AS "statuses_created_at" FROM "statuses" GROUP BY "statuses"."created_at"