app/controllers/pets_controller.rb

  def show
    @pet=Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pet = current_user.pets.build(pet_params)
    if @pet.save
---
INSERT INTO "pets" ("name", "sex", "old", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "クウ"], ["sex", "オス"], ["old", "0"], ["user_id", 1], ["created_at", "2023-03-11 18:46:54.464522"], ["updated_at", "2023-03-11 18:46:54.464522"]]

  def edit
    @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @pet = Pet.find(params[:id])
    if @pet.update(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pets" SET "old" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["old", "1"], ["updated_at", "2023-03-11 20:46:03.476158"], ["id", 1]]