app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def index
    @posts = current_user.posts.all

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "ｗｗｗ"], ["user_id", 1], ["created_at", "2023-04-04 07:09:46.863163"], ["updated_at", "2023-04-04 07:09:46.863163"]]
---
  def create
    @post = current_user.posts.build(post_params)
    @post.image.attach(params[:post][:image])