app/controllers/statuses_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "statuses" ("food", "weight", "temperature", "user_id", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["food", "20"], ["weight", "2"], ["temperature", "39"], ["user_id", 1], ["pet_id", 1], ["created_at", "2023-03-31 18:23:15.007229"], ["updated_at", "2023-03-31 18:23:15.007229"]]
---
  def create
    @pet = Pet.find(params[:pet_id])
    @status = current_user.statuses.build(status_params)
    if @status.save